const Discord = require('discord.js')
const client = new Discord.Client()
const config = require('./config.json')
const command = require('./command')
const fs = require("fs");
const fetch = require("node-fetch");
const math = require('mathjs');
const { tictactoe } = require('reconlx');


client.on("ready",()=>{
  console.log(`BOT ${client.user.tag} is now online!`)
  client.user.setActivity("Bot Chat By ERR0R SkaLax", {type:"COMPETING"})
})

//000
command(client, ['History'], (message) => {
	message.channel.send('```>>>Owner= ERR0R SkaLax```')
})
0
  command(client, ['พ่อมึงตาย', 'พ่อมึงอะ', 'พ่อง', 'พ่อมึง',], (message) => {
    message.channel.send('ควยไรไอสัส ต่อยมั้ย')
  })
//1
  command(client, ['น่ารักจัง', 'บอทน่ารัก', 'น่ารัก', 'บอทน่ารักวะ'], (message) => {
    message.channel.send('ก็คนทำบอทมันหล่อไง')
  })
//2
  command(client, ['บอทควาย'], (message) => {
    message.channel.send('ฉลาดกว่าพ่อมึงอะไอสัส')
  })
//3
  command(client, ['ไม่น่ารักเลย'], (message) => {
    message.channel.send('เรื่องของมึง')
  })
//4
  command(client, ['ข้นอีสาน'], (message) => {
    message.channel.send('อีสานละควยไรอะอีสานละหนักหัวพ่อมึงหรอ')
  })
//5
  command(client, ['กูหล่อ', 'กูน่ารัก', 'กูสวย'], (message) => {
    message.channel.send('ไปไกลๆส้นตีน')
  })
//6
  command(client, ['อยากสัมผัส'], (message) => {
    message.channel.send('กูศิษย์เจ๊นิว อยากสัมผัส')
  })
//7
  command(client, ['ควยไรหละ', 'ควย'], (message) => {
    message.channel.send('ละทำไมมึงจะทำไม')
  })
//8
  command(client, ['ต่อยกะกูป่าว'], (message) => {
    message.channel.send('มาเถอะเหมือนกลัวไอแม่เย็ด')
  })
//9
  command(client, ['แม่มึงตาย', 'แม่มึงอะ', 'แม่ง'], (message) => {
    message.channel.send('แม่มึงอะไอสัส')
  })
//10
  command(client, ['เย็ดกัน'], (message) => {
    message.channel.send('ควยกู56นะเดี๋ยวหีมึงฉีกหรอก')
  })
//11
  command(client, ['ฝันดี', 'ฝันดีค้าบ', 'ฝันดีครับ', 'ฝันดีค่ะ', 'ฝันดีค้า', 'ฝันดีค่า'], (message) => {
  message.channel.send('หลับให้สบายนะไอสัส')
   })
//12
  command(client, ['กูเหงา', 'เหงาจัง', 'เหงา', 'เหงามาก', 'เหงาเหมือนกัน' ], (message) => {
  message.channel.send('ไปหาไรแก้คันไป')
   })
//13
  command(client, ['อีสัส', 'อีควย', 'ไอเวร', 'อีเหี้ย', 'อีหน้าสัส', 'อีชั่ว', 'อีบอทชั่ว', 'บอทเหี้ย', 'ไอสัส', 'ไอควย', 'ไอเหี้ย', 'บอทเวร', 'อิเวร', 'อิเวน', 'อิควย', 'อิเหี้ย', 'อิชั่ว', 'สัส', 'ควย', 'เหี้ย'], (message) => {
  message.channel.send('หัดพูดเพราะๆบ้างนะไอเด็กเหี้ย')
  })
//14
  command(client, ['มาเดี่ยวกะกูมา'], (message) => {
  message.channel.send('มาดิเดี๋ยวซัดให้หมอบ')
  })
//15
  command(client, ['มาต่อยกะกูมา', 'ต่อยไหม', 'ต่อยกันไหม'], (message) => {
  message.channel.send('มาเถอะไม่เคยหวั่น')
  })
//16
  command(client, ['มกรากุมภามีนามีนาเมษา'], (message) => {
  message.channel.send('เพลงเชี่ยเนี่ยไรไอสัส')
  })
//17
  command(client, ['หน้าหี', 'ไอหน้าหี'], (message) => {
  message.channel.send('เดะจะเย็ดหน้ามึงให้ไอสัส')
  })
//18
  command(client, ['บอทโง่', 'โง่', 'ควาย'], (message) => {
  message.channel.send('IQต่ำขนาดนี้ ยังกล้าด่าคนอื่นว่าโง่อีกหรอคะตักน้ำใส่กะโหลกชะโงกดูเงาบ้างนะคะ')
  })
//19
command(client, ['555', '5555', '55555', '555555', '5555555', '55555555', '555555555', '5555555555', '55+', '555+', '5555+', '55555+', '555555+', '5555555+', '55555555+', '555555555+', '5555555555+', '55555555555+', '55'], (message) => {
  message.channel.send('ขำหาพ่อหาแม่มึงหรอไอเวร')
  })
//20
  command(client, ['ทำไมยังไม่นอน'], (message) => {
    message.channel.send('กูดีดม้า สักเม็ดไหมหละ')
  })
//21
  command(client, ['โสดไหม', 'บอทโสดไหม'], (message) => {
    message.channel.send('เย็ดตูดนะๆ5555')
  })
//22
  command(client, ['วิธีจีบสาว', 'วิธีจีบหนุ่ม'], (message) => {
    message.channel.send('คาถามหาเสน่ห์อินเลิฟยิ่งกว่าเดิมร้อยเท่าจันโทอะภกันตะโรปิติ ปิโย เทวะมนุสสานังอิตภิโยปุริ โสมะ อะ อุ อุ มะ อะ อิสวาสุ อิกะวิติ คาถาผัวรักผัวหลงโอม นะจิตตัง เห็นหน้า…(ชื่อ)…รักสนิทธาจับจิต ยะจับใจ…(ชื่อ)…นะหลงใหลจับใจ…(ชื่อ)…ให้มารัก นะโมพุทธายะ')
  })
//23
  command(client, ['บอท', 'ออล', 'ไอบอท', 'ไอบอทโง่', 'อีบอท'], (message) => {
    message.channel.send('เรียกทำไมไอสัสกูจะนอน')
  })
//24
command(client, ['ควยกูใหญ่'], (message) => {
  message.channel.send('เล็กเท่าจิ๋มมดทำแอ็คไอสัส')
})
//25
command(client, ['ไม่แบน', 'ไม่เตะ', 'ไม่ขำ'], (message) => {
  message.channel.send('เรื่องของมึง')
})
//26
command(client, ['ทำไมละ', 'ละจะทำไม', 'ไมอะ', 'ละจะทำไมอะ'], (message) => {
  message.channel.send('มาดิไอสัสทำไมธรรมโมโกโก้โอวัลติน')
})
//27
command(client, ['แส้ว', 'แส้วๆ', 'แส้วๆๆ', 'แส้วมาก', 'แส้วว่ะ', 'แส้ววะ', 'แส้วว'], (message) => {
  message.channel.send('แส้วพ่องเศร้าไอสัสเขียนให้ถูก')
})
//28
command(client, ['.', '...', '..', '....', '.....', '......', '.......', '........', '.........', '..........'], (message) => {
  message.channel.send('เดี๋ยวกูจะจุดจิ๋มแม่มึงไอสัส')
})
//29
command(client, ['โสด', 'หาแฟน', 'โสดครับ', 'โสดค้าบ', 'โสดน้า', 'โสดนะ', 'โสดค่ะ', 'หาแฟนค่ะ', 'หาแฟนครับ', 'หาแฟนค้าบ'], (message) => {
  message.channel.send('ว้ายอิพวกไม่มีใครเอา')
})
//30
command(client, ['จีบ', 'จีบนะ', 'จีบได้ไหม', 'จีบได้ไหมครับ', 'จีบได้ไหมคะ', 'จีบได้ไหมงะ'], (message) => {
  message.channel.send('จีบพ่อมึงอะเดะถีบให้')
})
//31
command(client, ['ยินดีต้อนรับ', 'ยินดีต้อนรับนะ', 'ยินดีต้อนรับนะคะ', 'ยินดีต้อนรับนะครับ'], (message) => {
  message.channel.send('ยินดีต้อนรับนะไอสัส')
})
//32
command(client, ['ออกไปอีสัส.'], (message) => {
  message.channel.send('อย่าเข้าดิสกูมาอีกนะกูจะเสยให้')
})
//33 
command(client, ['ควยกูเล็ก'], (message) => {
  message.channel.send('รู้ตัวดีนี่ไอโง่')
})
//34
command(client, ['รรคสจ'], (message) => {
  message.channel.send('เรียกร้องความสนใจทำเหี้ยไรน่ารำคาญไอสัส')
})
//35
command(client, ['สวัสดีครับ', 'สวัสดีค่ะ', 'สวัสดีค่า', 'สวัสดี', 'หวัดดี', 'หวัดดีคับ', 'หวัดดีครับ', 'หวัดดีงับ', 'สวัสดีคับ', 'สวัสดีงับ', 'สวัสดีคะ', 'หวัดดีจ้า', 'สวัสดีจ้า', 'หวัดดีจ้าา', 'หวัดดีจ้าาา', 'หวัดดีจ้าาาา', 'หวัดดีจ้าาาาา'], (message) => {
  message.channel.send('พนมมือไหว้กูด้วยดิไอเหี้ยที่บ้านไม่สอนมารยาทอ่อ')
})
//36
command(client, ['หัวดิสขยะ', 'ดิสขยะ'], (message) => {
  message.channel.send('สุดยอด ดีเลิศ เด็ดขาด อันดับหนึ่ง ศักดิ์สิทธิ์ มหัศจรรย์ ที่สุด สุดยอด เยี่ยม ยอดเยี่ยม ยอดเยี่ยมยอด ดีที่สุด เลิศที่สุด ชนะเลิศ เลิศเลอ ดีเด่น สุดเหวี่ยง วิเศษ ฮีโร่ บริสุทธิ์ ล้ำเลิศ ชั้นเลิศ เลิศล้ำ เด็ด หนึ่งเดียว พิเศษ ยอดไปเลย เยี่ยมไปเลย ที่หนึ่งเลย โดดเด่น')
})
//37
command(client, ['คิดว่าเป็นบอทแล้วซ่ามากหรอ'], (message) => {
  message.channel.send('ก็พอตัวอะนะไอเวร')
})
//38
command(client, ['ว้าว', 'ว้าวซ่า', '้ว้าวว', 'ว้าววว', 'ว้าวววว'], (message) => {
  message.channel.send('เดะจัดให้หน้าร้าวหรอกไอสัส')
})
//39
command(client, ['มิว'], (message) => {
  message.channel.send('เรียกมันทำไมเรียกกูนี่ไอสัส')
})
//40
command(client, ['กาก', 'อ่อน'], (message) => {
  message.channel.send('เดะก็ย่ำหน้าให้ไอเหี้ย')
})
//41
command(client, ['หมีเหี้ย', 'ไอเหี้ยหมี', 'ไอหมี', 'ไอสัสหมี', 'ควยหมี', 'หมีควย', 'เหี้ยหมี', 'ไอ้เหี้ยหมี', 'ไอ่เหี้ยหมี'], (message) => {
  message.channel.send('เห้ยเรียกเจ้านายกูดีๆเดะทิ่มหน้าให้ไอสัส')
})
//42
command(client, ['โย', 'น้อนโย', 'เชี่ยโย'], (message) => {
  message.channel.send('ไอเด็กเชี่ยยยยยยยยยย')
})
//43
command(client, ['เอ้า'], (message) => {
  message.channel.send('เอ้าเชี้ยไรเดะกูจะเอามึงนี่')
})
//44
command(client, ['บอทช่วยด้วยไอสัส'], (message) => {
  message.channel.send('```คำสั่งบอทจะใช้ได้เฉพาะกับคนที่มียศเท่านั่น คำสั่ง(ไม่ต้องใส่Prefix ให้พิมไปทั้งดุ้นเลย)                                                                              เปิดดูคำสั่งบอท = บอทช่วยด้วยไอสัส                                                                                  cc = ลบข้อความ10ข้อความ                                                                                          แบน = แบนคนโดนการเขียนว่า แบน แล้วแท็กชื่อ                                                             เตะ = เตะคนโดนการเขียนว่า เตะ แล้วแท็กชื่อ                                                                   ดูเซิฟ = การดู Serverinfo                                                                   ?p ตามด้วยชื่อหรือลิงค์เพลง = เปิดเพลงใช้คำสั่ง                                                                   ?pl ตามด้วยลิงค์เพลย์ลิสต์ = เปิดเพลงทั้งเพลย์ลิสต์                                                                   ?s = ข้ามเพลง                                                                               ?stop = หยุดการเล่นเพลงทั้งหมด                                                                               ?q = ดูรายการเพลงที่เปิด                                                                   ?lyrics = เปิดเนื้อเพลงของเพลงนั้น                                                                   ?vol ตามด้วยระดับเสียง1-100 = ปรับเสียงบอท                                                                                ?loop = เปิด-ปิดการเล่นเพลงซ้ำ                                                                             เช็คโควิท = ?covidth                                                                              (มีแต่ 𝓐𝓵𝓵𝓒𝓸𝓶𝓶𝓪𝓷𝓭 ที่เปิดเพลงได้)                                                                             BadMouth&𝓐𝓵𝓵𝓒𝓸𝓶𝓶𝓪𝓷𝓭 V1.3.0```')
})
//45
command(client, ['บอทปากแซ่บวะ', 'บอทปากดีวะ', 'บอทปากแซ่บ', 'บอทปากดี', 'ปากหมา'], (message) => {
  message.channel.send('เอ้าเชี้ยไรเดะกูจะเอาควยไรยัดปากมึงนี่')
})
//46
command(client, ['ทำอะไรอยู่', 'ทำอะไรกันครับ', 'ทำอะไรกันคะ', 'ทำไร', 'ทำไรอยู่', 'ทำไรอยู่ครับ', 'ทำไรอยู่คะ', 'ทำไรค้าบ', 'ทำไรคะ'], (message) => {
  message.channel.send('เรื่องของกูเสือกเชี้ยไรชีวิตกูละ')
})
//47
command(client, ['งง', 'งงนะ', 'งงวะ', 'งงอะ', 'งงเว้ย', 'งงงะ'], (message) => {
  message.channel.send('งงเหี้ยไรไอโง่')
})
//48
/*command(client, ['โมซี', 'โมซี่', 'mosey'], (message) => {
  message.channel.send('จะติดคุกอยู่ละ555555')
})*/
//49 
command(client, ['ไอเชี้ยเป็ด', 'ไอเหี้ยเป็ด', 'ไอเป็ดเวร', 'ไอเหี้ยเป็ด`~', 'ไอเหี้ยเป็ด~`', 'เป็ดโง่'], (message) => {
  message.channel.send('มึงเรียกเจ้านายกูดีดีดิ้ไอหน้าหี')
})
//51
command(client, ['รักนะคะ'], (message) => {
  message.channel.send('รักกูด้วยดิไอหน้าเหี้ย')
})
//52
command(client, ['เด็กเวร'], (message) => {
  message.channel.send('ด่าตัวเองทำเหี้ยไรไอโง่')
})
//53
command(client, ['ทุกคนมาสวดมนต์กัน'], (message) => {
  message.channel.send('เออหัดสวดสะบ้างไอบาปหนา')
})
//54
command(client, ['มาสวดมนต์กันค่ะ', 'มาสวดมนต์กันครับ'], (message) => {
  message.channel.send
  ('เอาไอพวกชั่วพนมมือ                                                                                                                                                                           สัพเพ สัตตา อะเวรา โหนตุ  สัตว์ทั้งหลายที่เป็นเพื่อนทุกข์ เกิด แก่ เจ็บ ตายด้วยกันทั้งหมดทั้งสิ้น  จงเป็นสุขๆ เถิด อย่าได้มีเวรแก่กันและกันเลยอัพญาปัชฌา โหนตุ  จงเป็นสุขๆ เถิด อย่าได้พยาบาทเบียดเบียนซึ่งกันและกันเลย อะนีฆา โหนตุ  จงเป็นสุขๆ เถิด อย่าได้มีความทุกข์กาย ทุกข์ใจเลยสุขี อัตตานัง ปะริหะรันตุฯ   จงมีความสุขกาย สุขใจ รักษาตนให้พ้นจากทุกข์ภัยทั้งสิ้นนี้เทอญฯ                                                                                                                  ข้าพเจ้าขอถอนคำสัญญา คำสาบาน คำอธิษฐานที่ผูกมัดตัวเองและผู้อื่น ขอให้ต่างฝ่ายต่างเป็นอิสระจากสัญญาทั้งปวง หากมีผู้ใดเคยสร้างเวรสร้างกรรมกับข้าพเจ้า ไม่ว่าจะชาติใดภพใดก็ตาม  ข้าพเจ้ายินดีอโหสิกรรมให้ ขอถอนความอาฆาต ความพยาบาท และคำสาปแช่งในทุกชาติ ทุกภพ ขอให้ข้าพเจ้าพ้นจากคำสาปแช่ง ของปวงชนของเจ้ากรรมนายเวรทั้งหมดทั้ง')
})
//55
command(client, ['บอทฉลาด', 'บอทดี', 'บอทสุดยอด'], (message) => {
  message.channel.send('อีตอแหล')
})
//56
command(client, ['ว่าง', 'ว่างมาก', 'ว่างจัง', 'ว่างจัด', 'ว่างค่ะ', 'ว่างครับ', 'ว่างค้าบ', 'ว่างค้า', 'ว่างวะ', 'ว่างว่ะ'], (message) => {
  message.channel.send('มึงก็ไปหาไรทำนั่งนอนหายใจทิ้งทำเชี้ยไร')
})
//57
command(client, ['เจริญๆเด้อ'], (message) => {
  message.channel.send('เจริญพ่อมึงอะอีสันขวานนรก')
})
//58
command(client, ['มอนิ่งครับ', 'มอนิ่งงับ', 'มอนิ่งค่ะ', 'มอนิ่งคะ', 'มอนิ่งง', 'มอนิ่ง'], (message) => {
  message.channel.send('มอนิ่งไอนรก')
})
//59
command(client, ['คะ', 'ค่ะ', 'ครับ', 'ค้าบ', 'คับ', 'ค้าา', 'ค้า'], (message) => {
  message.channel.send('พูดเพราะก็เป็นนิไอปากปีจอ')
})

//61
command(client, ['หมีหล่อไหม'], (message) => {
	message.channel.send('โคตรหล่อเจ้าของกูนี่หล่อที่สุดละ')
})

//64
command(client, ['แง', 'แงง', 'แงงง', 'แงงงง', 'แงงงงง', 'แงงงงงง'], (message) => {
	message.channel.send('โอ๋ๆร้องไห้หาพ่อมึงรึไงหยุดร้องได้ละอีสันขวาน')
})
//65
command(client, ['ดีครับ', 'ดีงับ', 'ดีค่ะ', 'ดีคะ', 'ดีคับ'], (message) => {
	message.channel.send('ไอสัสมึงพิมพ์ให้ถูกดิ้ไอโง่ สวัสดีครับ/ค่ะ มันยากตรงไหนอีiqต่ำ')
})
//66
command(client, ['ไม่รู้'], (message) => {
	message.channel.send('ชีวิตนี้มึงจะรู้เหี้ยไรบ้าง')
})
//67
command(client, [';-;', '-_-', ':P'], (message) => {
	message.channel.send('มึงรู้จักอิโมจิไหมแค่กดไปใช้มันยากนักรึไงอีเวร')
})
//68
command(client, ['เค', 'เคร', 'โอเค', 'โอเคร'], (message) => {
	message.channel.send('กูดมด้วยๆกูอยากจมูกขาว')
})
//69
command(client, ['ท้อ', 'เป็นท้อ'], (message) => {
	message.channel.send('จะท้อทำพระแสงเลเซอร์อะไรไปหาไรทำไปอีนรก')
})
//70
command(client, ['เขิน'], (message) => {
	message.channel.send('มึงจะเขินเชี้ยไรเล่าบ้าละมึงอะ')
})
//71
command(client, ['ไอมนต์'], (message) => {
	message.channel.send('ไอแก่ฟิวเตอร์')
})
//72
command(client, ['จังไร'], (message) => {
	message.channel.send('ไอพวกจังไรกูรับไม่ได้กูใสๆ')
})

//75
command(client, ['ร่าน'], (message) => {
  message.channel.send('เลิกร่านได้ละนะอีหีสาธารณะ')
})
//76
command(client, ['เรารักแก'], (message) => {
	message.channel.send('รักเหี้ยไรไอโบ้หน้าโง่ไอสัส')
})
//77

command(client, ['บอทหน้าหี', 'บอทหน้าโง่',], (message) => {
  message.channel.send('ละควยไรหละไอสัสจะต่อยกับกูไหม')
})

//79
command(client, ['เป็ด', 'หมี', 'สมพงษ์'], (message) => {
  message.channel.send('คนดีๆของสังคม คนที่สังคมต้องการ')
})

//78
command(client, ['เสือก', 'บอทเสือก', 'อย่าเสิอก'], (message) => {
  message.channel.send('ชีวิตกูยุ่งเหี้ยไรหละ')
})

//79
command(client, ['<@838652652346146846>'], (message) => {
	message.channel.send('จะแท็กกูทำเหี้ยไรหละว่างหรอ')
})

//80
command(client, ['ว่าง', 'ว่างมาก', 'ว่างดิ', 'ว่างง', 'ว่างงง', 'ว่างจัด'], (message) => {
	message.channel.send('ว่างก็ไปหาไรทำนะอย่าหายใจทิ้งไปวันๆรกโลก')
})

  
  command(client, 'ดูเซิฟ', (message) => {
  const { guild } = message
  
  const { name, region, memberCount, owner, afkTimeout } = guild
  const icon = guild.iconURL()
  
  const embed = new Discord.MessageEmbed()
    .setTitle(`Server info for "${name}"`)
    .setThumbnail(icon)
    .addFields(
      {
        name: 'Region',
        value: region,
      },
      {
        name: 'Members',
        value: memberCount,
      },
      {
        name: 'Owner',
        value: owner,
      },
      {
        name: 'AFK Timeout',
        value: afkTimeout / 60,
      }
      
    )
    if (message.member.hasPermission('ADMINISTRATOR'))
  message.channel.send(embed)
  })
  
  command(client, 'เซิฟlist', (message) => {
    if (message.member.hasPermission('ADMINISTRATOR'))
    client.guilds.cache.forEach((guild) => {
      message.channel.send(
        `${guild.name} has a total of ${guild.memberCount} members`
      )
    })
  })
  
  client.on('message', message => {

    const args = message.content.slice(config.prefix).trim().split(/ +/);
  
      switch(args[0]) {
        case 'คำคม' :
          rndmessage(message);
  
          function rndmessage(message) {
            var messages = ['ไม่ชอบกินเด็ก แต่ชอบเป็นเด็กให้ผู้ใหญ่กิน', 
            'น่ารักป่าวไม่รู้แต่รอให้รักอยู่รู้มั้ย', 
            'ไม่ต้องบอกรักให้รู้สึกดี แต่โปรดโอนเงินเข้าบัญชีให้รู้สึกรัก', 
            'มองกล้องอ่ะทำเผลอ แต่มองเธออ่ะ เราตั้งใจ', 
            'เป็นคนเรียบร้อย พูดน้อย น่าฟัด',
            'อากาศก็ร้อน คนให้อ้อนก็ไม่มี',
            'เบื่อชีวิตอิสระ อยากหาจังหวะมีเจ้าของ',
            'เบื่อแล้วชีวิตคนโสด มาอยู่ในโหมดมีคู่กะเราป่ะ',
            'แก้วเหล้าอ่ะปล่อยบ้าง มือเรายังว่าง อยากจับไหม',
            'แบตหมดให้เดินไปหาปลั๊ก แต่ถ้าขาดความรักให้เดินมาหาเรา',
            'ช่วงนี้อ่อนไหว มองหน้าใครก็ใช่ไปหมดเลย',
            'UV ไม่ดีต่อตา แต่ถ้า U มองมามันดีต่อใจ',
            'เดือนนี้อ่ะมีนา เดือนไหนน้าเราจะมีกันและกัน',
            'หญิงใดไม่ดัดจริต ก็หมดสิทธิ์ที่จะเป็นเสือ',
            'เห็นเราเป็นทางผ่าน ระวัง!!! เราจะตั้งด่านเก็บภาษี',
            'ชวนทำอย่างอื่นอะตอนไหนก็ไม่ว่าง แต่ถ้าชวนไปนอนข้าง ๆ อะว่างทุกตอน',
            'โสดมานาน ให้ขึ้นคานคงไม่ไหว รับสมัครคนมีใจ ช่วยพาไอลงจากคาน',
            'คนมีคู่ยังบอกว่าเหงา แล้วคนโสดอย่างเราจะเหลืออะไร',
            'หน้าหนาวกำลังมา รับสมัครคนห่มผ้าให้มั๊ยคะ',
            'ระฆังดังเพราะคนตี น่ารักดีมีแฟนยัง',
            'ถึงใต้คางยังมีเหนียง แต่ข้างเคียงยังไม่มีใคร',
            'แต่ก่อนแชทเด้งจนโทรศัพท์ค้าง ตอนนี้แชทอ้างว้างนึกว่าโทรศัพท์พัง',
            'ที่เดินผ่านบ่อย ๆ ก็แค่อยากเข้าไปอยู่ในสายตา อยากให้มองมาแล้วได้สบตาสักครั้ง',
            'ถ้าคนสวยเค้าเจ้าชู้ หันมาคบคนหุ่นหมู แบบหนูก็ได้นะ',
            'เป็นโรคซึมเศร้า แต่ถ้ามีเงินเข้าเดี๋ยวก็หาย',
            'หลังเลือกคนดีเข้าสภา อย่าลืมเลือกคนธรรมดาเข้าสู่หัวใจ',
            'ถ่ายรูปคนเดียวมันไม่คูล มาถ่ายคู่กันดูไหม',
            'ไม่ได้เป็นคนชอบอ่อย แค่อยากให้ลองของอร่อยเท่านั้นเอง',
            'รอคุณทักมา เหมือนรอจินตหราไว้ผมยาว',
            'ตัวเล็กอุ้มง่าย อุ้มได้เอาไปเลย',
            'ร้อนแบบนี้เรากลัวจังว่าจะชัก…ชักจะตกหลุมรักเธอแล้วแหละ',
            'เห็นแดดแล้วเราจะละลาย แต่เห็นผู้ชายแล้วเราจะร่าเริง',
            'ยาเสพติดให้โทษ แต่ถ้าเธอโสดโปรดให้ท่า',
            'ทำยังไงให้เห็นค่า ต้องติดราคาไว้ตรงไหน',
            'สวยอย่างมีสไตล์ เพื่อผู้ชายมีสตางค์',
            'ยิ้มที่ส่งให้ไป เธอไม่หวั่นบ้างหรอ',
            'เธอรู้ปะเราชอบใครหัวใจลองอ่านคำแรกสิ',
            'กินข้าวอร่อยดี แต่กินพี่อร่อยกว่า',
            'ถ้าเธอไม่ใส่ใจ เราจะไม่ใส่อะไรเลยนะ',
            'หน้าตาซื่อ ๆ จะดื้อได้ไงล่ะ',
            'เหนื่อยจังเลย ไม่ได้อยากได้กำลังใจนะ อยากได้เธอ',
            'ห้ามอะไรห้ามได้ แต่ห้ามหวั่นไหวนี่ยากจัง',
            'จากแม่เสือ อยากกลายเป็นเหยื่อถูกล่า',
            'อยากโทรถามเคอรี่ ความรักที่ส่งให้เธอนี่ กี่วันถึง',
            'ไม่ต้องไปหรอกบางแสน มานอนซบแขนเราดีกว่า',
            'ขาดแว่นโลกคงเบลอ ขาดเธอโลกคงพัง',
            'ไม่อร่อยเหมือนสตาร์บั๊คแต่ถ้าได้ลองสักพักรับรองว่ารสจัดกว่าอเมซอล',
            'คำคมเป็นแสน แต่แฟนเป็นศูนย์.',
            'สะบัดน้ำมันพรายไปเป็นลิตร เธอบอกคิดแค่พี่น้อง',
            'อยากเมาไห้กินเบียร์ แต่ถ้าอยากเพลีย ไห้กินเรา',
            'หน้าตาอาจดูเจ้าชู้ แต่ถ้าได้เป็นแฟนดูจะรู้ว่าเราน่ารัก',
            'บางทีคนในฝันเค้าก็เหมาะจะอยู่”แค่ในฝัน”',
            'บางทีคนในฝันเค้าก็เหมาะจะอยู่”แค่ในฝัน”',
            'ถ้าแกล้ง…โง่… แล้วยัง…เจ็บ… นั้น…แหละ… เรียกว่า… ” โง่ “',
            'หัวใจนะไม่ใช่ที่สาธารณะ ที่คิดถึงก็กลับมา หมดรักก็จากไป',
            'ธรรมชาติของน้ำ คือ “ไหลจากที่สูงลงที่ต่ำ” ไม่ต่างกับ ธรรมชาติของความรัก ที่มักจะ “ลดลงต่ำหลังจากที่เคยสูง',
            'อย่ามีใคร เพราะ “ความเหงาเขาอาจอยู่กับเราได้ “ไม่นาน” อย่ามีใคร เพราะ “ความสงสาร” อาจจบแบบ “ทรมาน” ทั้งสองคน',
            'เจอคน “คิดมาก” ก็แค่ “เหนื่อยใจ”.แต่.เจอคนบอก “ไม่คิดอะไร “มันทั้งเจ็บใจ” และ “ไปไม่เป็น',
            'ไม่รักษาสัญญาไม่เป็นไร. “แต่กรุณารักษาใจ ของคนที่คุณเคยให้สัญญา”',
            'การปล่อยให้เขาไป… มิใช่การยอมแพ้ แต่เป็นการยอมรับ… ในสิ่งที่เป็นไปไม่ได้ต่างหาก',
            'เชื่อว่า หลาย ๆ คนสามารถเป็น “แฟน” ที่ดีได้ แต่..น่าเสียดายที่ไม่มีโอกาสได้เป็น',
            'ความคิดถึงบางทีมันก็เจ็บ เมื่อคนที่เราคิดถึงนั้นเขาไปคิดถึงคนอื่น',
            'ความเหงาอาจจะไม่เคยตาย แต่มีคนมากมาย จะตายเพราะ…ความเหงา',
            'ตอนเด็ก ๆ ชอบเล่นซ่อนหา พอโตมาเลยชอบซ่อนความรู้สึก',
            'บางที “ระยะเวลา” อาจจะไม่ใช่คำตอบของความรัก “เสียงหัวใจ” ต่างหาก ที่บอกว่า ความรักของเรา เป็นคำตอบของใคร',
            'ถ้าย้อนเวลาได้จริงๆ ยังไม่รู้เลย! .. ว่าอยากจะย้อน ไปตอนไหน? ย้อนไป ตอนที่เธอ “ไม่มีใคร?” .. หรือ จะย้อนไป ตอนที่ใจ “ไม่มีเธอ!',
            'คนบางคนทำเหมือนจะมีใจ…. แต่พอเจอเธอทีไร… ทำไมถึงไปอยู่กับเขา',
            'คนบางคนก็น่ารักเกินไป… จนไม่มีผู้ชายคนไหน.. คิดว่าตัวเองคู่ควร',
            'คำว่า ” รัก ” พูดไปก็ไร้ค่า……ถ้าคนที่อยู่ข้างหน้า….ไปมีใจให้คนอื่น',
            'ถ้าคุณ “รักใครสักคน” คุณจะรู้ว่า “ความอดทน” สะกดยังไง',
            'อยากเป็น ” มาก กว่า เพื่อน ” แต่เขาอยากให้เป็น ” เพื่อน มาก กว่า',
            'ความเหงา เกิดขึ้น…เมื่อเราให้ความสำคัญกับคนอื่น… มากกว่าตัวเราเอง',
            'อยากจะบอกว่าคิดถึงแทบขาดใจ แต่มาคิดทบทวนไม่รู้จะบอกใน ฐานะ อะไร',
            'รักใครอย่าทิ้ง รักจริงอย่าจาก รักใครอย่าพราก รักแต่ปากอย่ารักเลย',
            'คนที่”รักเรา” เขาไม่มีวัน”เลิกรา” แต่คนที่ทำให้เรามี”น้ำตา” ทำไมเราไม่มีวัน”เลิกรัก',
            'เมื่อก่อนโทรหาเธอบอกดีใจ แต่เดี๋ยวนี้โทรไปเธอถามว่ามีอะไรรึเปล่า',
            'ตาโต”เมื่อถูกเธอ”สวมกอด”แต่แทบ”ตาบอด”เมื่อถูกเธอ”สวมเขา”',
            'กูแกล้งโง่”เพราะความรัก… แต่ “มึงแกล้งรัก”เพราะคิดว่ากูโง่',
            'ถ้าหากเธอยัง..ไม่พร้อม ก็อย่าเพิ่ง ” เข้ามา “เพราะเราก็..ไม่พร้อม..จะเสีย ” น้ำตา ” เมื่อเธอจากไป',
            'ตั้งแต่เกิดมา กับความรัก เคยเจ็บแค่สองครั้ง คือ ครั้งแล้ว กะ ครั้งเล่า',
            'บางคนก็แปลกนะ ทิ้ง”คนที่รัก” ไปรัก”คนที่ทิ้ง”',
            'เคยไหม..บอก”แฟน”ว่าไม่มีใคร และบอกใคร ๆ ว่า…ไม่มี”แฟน',
            'บ่อยครั้งที่ความรู้สึกจริง ๆ ก็แฝงมากับคำพูดเล่น ๆ',
            'อย่าทำให้สับสน เพราะคนบางคนคิดไกล อย่าทำให้หวั่นไหว ถ้าไม่มีใจ…รักจริง',
            'บางคนมีรัก กลับไม่รักษา บางคนตามหา..กลับไม่เคยเจอ',
            'ผู้ชายดี ๆ ที่มีอยู่ในนิยาย เป็นได้แค่ควายในโลกแห่งความจริง',
            'ส่วนเกิน” หมายถึง “มีตัวตนในสายตา”.แต่ “ไร้ค่า ในจิตใจ.',
            'รั้ง” กับ “รอ” ปริมาณความ “ท้อ” พอ ๆ กัน',
            'ยอมเป็นแค่คนดีที่ไม่มีใคร ดีกว่าเป็นคนหลายใจที่ไม่มีอะไรดี',
            'กินข้าวอาจจะอ้วน แต่กินหนูไม่อ้วน แต่อร่อย',
            'อาจจะไม่เหมือนเสือ ที่น่าขยุ้ม แต่ก็มีแก้มนุ่มๆ ที่น่าขย้ำ',
            'แคปชั่นมีเป็นพัน คนสำคัญมีแค่คนเดียว',
            'หัวใจไม่ได้มีไว้แจก อยากได้ก็เอาใจมาแลกสิ',
            'เป็นลูกเสือต้องมองไกล ถ้าอยากเป็นคนรู้ใจให้มองมาที่เรา',
            'อกหักต้องรีบทำใจ เดี๋ยวคนต่อไป จะรอนาน',
            'ไม่เอาบาป ไม่เอาบุญ แต่ผมจะเอาคุณ โอเคนะ',
            'ไม่มีพิษ ไม่มีภัย มีแต่ใจเอาป่ะล่ะ',
            'น่ารักกรุบกริบ แต่ไม่มีใครหยิบไปเป็นแฟน',
            'เบื่อแล้วข้าวหน้าหมู ปลา ไก่ อยากกินหน้าแบบหนู ที่ไหนมีขายบ้างคะ',
            'ยอมอยู่เป็นโสด เพราะรักมันโหดเหลือเกิน',
            'ถ้าพี่ไม่ชอบกินเด็ก ถ้าเป็นเด็กที่อยากกินพี่ โอเคไหม',
            'ชอบเขาก็จงไปหาเขา แต่ถ้าชอบเราห้ามหนีไปไหน',
            'ข้างหลังเป็นร้านกาแฟ แต่ข้าง ๆ แกเป็นเราได้ไหม',
            'เด็กดีเป็นอยู่แล้ว แต่ตอนนี้อยากเป็นเด็กพี่มากกว่า',
            'เธอบอกอยากกินอะไรอร่อยๆ จะบ้าหรอ เธอจะกินเราไม่ได้นะ',
            'ถ้าเธอเป็นเสือ เราเล่นบทเหยื่อเก่งนะ',
            'ตัวจริงไม่น่ารักหรอก แต่น่ากิน',
            'อย่ามาแกล้งจีบเพื่อหวังบริโภค เพราะสะโพก มีไว้โยกกับคนที่ใช่',
            'กินเก่งเลี้ยงง่าย​ จีบได้ไม่ดื้อ',
            'ไปไหนได้บ้าง ไปอยู่ข้างๆได้ไหม',
            'ปิดใจแหละ แต่ห้องยังเปิดอยู่',
            'ถ้ายังไม่มีใคร แนะนำให้มีเรา',
            'บอกหนูไม่เด็ด พี่กินเผ็ดไม่เป็นอ่ะป่าว',
            'หลงทางไม่ว่า แต่หลงเราระวังจะติดใจ',
            'ไม่ไหวอย่าฝืน ไม่มีที่ยืนก็มานอนกับเรา',
            'อ้วนจนมีเหนียง เธอจะเลี้ยงเราไหวไหม',
            'อาจจะอยู่ไกล แต่ไม่หายไปไหนแน่นอน',
            'อยู่บนเขา มันไม่อุ่นเท่าอยู่บนเราหรอก',
            'ไม่แพ้หรอกฝุ่น แพ้คุณ​มากกว่า',
            'เราก็เหมือนยาดม ไม่เน้นให้ใครชื่นชม แต่เน้นให้คนชื่นใจ',
            'แดดแรงทำให้หน้าพัง แต่เธอน่ารักจังทำให้หน้าแดง',
            'แม่หนูชอบเขา ไม่เอาแล้วทะเล🌲🌄',
            'จีบเราไม่ต้องเปย์...ขอแค่ทุ่มเทและใส่ใจ ❤',
            'เป็นเด็กอ้วนมันไม่ดี เป็นเด็กดีของพี่ได้เปล่า 😆',
            'อยากเจอรักดีดี นาทีนี้ก็ต้องเราแล้วป่ะ 😂',
            'ของอร่อยมีแต่ทำให้เราอ้วน แล้วเราอ้วนคิดดูว่าจะอร่อยแค่ไหน 🐷',
            'รีบจีบตอนนี้ ถ้าสวยกว่านี้จีบยากละนะ',
            'เป็นคนยิ้มยาก แต่ถ้าชอบใครมากๆ จะยิ้มให้',
            'เราเป็นคนหน้านิ่ง ไม่อยากยิ้มเดี๋ยวเธอละลาย',
            'ไม่อยากเป็น Number One อยากเป็นแค่ Only One ของเธอก็พอ',
            'ไม่ใช่ผู้หญิงสวย ที่อยู่ใกล้แล้วสบายตา แต่เป็นผู้หญิงที่ฮา อยู่ใกล้แล้วสบายใจ',
            'ช่วงนี้อ่อนไหว มองหน้าใครก็ใช่ไปหมดเลย',
            'รอเธอมาจีบ อยากถูกถีบตกคาน',
            'มุขเสี่ยวเราไม่มี แต่ใจดีๆ อะมีแน่นอน ❤',
            'ข้างกายมันเหงา มาอยู่ข้างเราดีกว่ามั้ย',
            'โสดโอนไว มีความจริงใจแถมให้ด้วย',
            'ไม่สวยไม่ขาว แต่หน้าหนาวกอดอุ่นนะ',
            'อยู่คนเดียวมันอิสระ แต่ลองคบเรามั้ยจ๊ะแล้วจะสนุก',
            'มีตะปูต้องมีค้อน แต่ถ้าอยากมีคนให้อ้อน ต้องมีเค้า',
            'ถ้าเธอไม่ชอบความเหงา งั้นหันมาชอบเราก็ได้นะ',
            'ช่วงนี้รู้สึกว่าหนักใจ..ขอเอาไปวางไว้ที่เธอได้ป่ะ',
            'ยืนอยู่คนเดียวเพราะหลงทาง พอเธอมายืนข้างๆ เลยหลงเธอ',
            'รถติดให้เผื่อเวลา แต่ถ้าได้เธอมาจะไม่เผื่อใจ',
            'หวานเป็นลม เราไม่ขมนะกินได้ 😛',
            'ไม่ต้องฟอลโล่วไอจี แต่ช่วยฟอลอินเลิฟวิทมีได้มั้ย',
            'พยายามเป็นคนที่ใช่ แต่ลืมไปคนที่ใช่ไม่ต้องพยายาม',
            'รักที่เราก่อ ฝากเขาสานต่อด้วยนะ',
            'คนโดนเท ไม่มีใครโอเคนะรู้ไว้',
            'แกล้งโง่ก็ลำบาก พอรู้มากก็เสียใจ',
            'การตั้งความหวัง คือการเสี่ยงกับความเจ็บปวด',
            'นู่นก็ทะเล นี่ก็เขา แล้วเราอยู่ตรงไหน',
            'ความรู้สึกของฉันมันว่างเปล่า เหมือนกับหัวใจของคุณ ที่มันไม่เคยมีฉันอยู่ในนั้น',
            'ความรู้สึกของฉันมันว่างเปล่า เหมือนกับหัวใจของคุณ ที่มันไม่เคยมีฉันอยู่ในนั้น',
            'ไม่มีเหตุผลที่จะอยู่ นั่นแหละคือเหตุผลดีๆ ที่จะไป',
            'อย่ากลัวการเริ่มต้นใหม่ เพราะเราอาจไปได้ไกลมากกว่าเดิม',
            'ที่รัก กับ ที่พัก มันมีเส้นบางๆ กั้นกันอยู่',
            'เจ็บกว่าการไม่รัก คือรักคนที่รักไม่ได้',
            'เสียใจสิบครั้ง ยังไม่เท่ากับ เสียความรู้สึกเพียงครั้งเดียว',
            'คงเป็นใครก็ได้ที่ไม่ใช่ฉัน',
            'ถ้าหากว่าเขาดีกว่า เราก็ยินดีด้วย',
            'มีไม่กี่คนที่พยายามซ่อมแก้วที่แตกไปแล้วให้อยู่ในสภาพเดิม ไม่ใช่เพราะ เสียดายแต่เพราะยังรักอยู่',
            'เจ็บปวดกับคำว่าลา และหมดศรัทธากับคำว่ารัก',
            'เป็นโสดก็เหงา รักเขาก็เจ็บ',
            'เวลาที่ควรจะเป็นของเรา เธอเอาไปให้ใครหมด'
          ];
            var rnd = Math.floor(Math.random() * messages.length);
  
            message.channel.send(messages[rnd]);
          }
          break;
        }
      })
    
      client.on('message', message => {

        const args = message.content.slice(config.prefix).trim().split(/ +/);
      
          switch(args[0]) {
            case 'ความรู้' :
              rndmessage(message);
      
              function rndmessage(message) {
                var messages = ['',
                'โลกของเรามีน้ำหนัก 5,972,000,000,000,000,000,000 ตันและมีเส้นผ่าศูนย์กลางยาว 6,440 กิโลเมตร หลุมลึกที่สุดที่มนุษย์สามารถขุดได้ลึกคือ 13 กิโลเมตร',
                'โลกโคจรด้วยความเร็ว 29.8 กิโลเมตรต่อวินาที',
                'ภูเขาไฟที่ใหญ่ที่สุดในระบบสุริยะจักรวาลชื่อ Olympus Mons อยู่ที่ดาวอังคารมีความสูง 27 กิโลเมตร',
                'ประเทศอินโดนีเซียมีเกาะรวมทั้งหมด 137,000 เกาะ',
                'จุดที่สูงจากน้ำทะเลมากที่สุดอยู่ที่รัฐ เพนซิลเวเนีย แต่อยู่ต่ำกว่าจุดที่อยู่ต่ำสุดของรัฐ โคโลราโด',
                'ทะเลสาบสงขลา คือทะเลสาบน้ำเค็มแห่งเดียวในประเทศไทย',
                'แม่น้ำที่สั้นที่สุดในโลก ชื่อว่า โร ยาว 61 เมตรที่รัฐมอนทานา ประเทศสหรัฐอเมริกา',
                'พระเจ้าอเล็กซานเดอร์มหาราช เป็นคนค้นพบกล้วยหอมเป็นครั้งแรกในปี ค.ศ. 327 ขณะทำสงครามในอินเดีย',
                'เห็ดที่มีขนาดเล็กที่สุดมีชื่อว่า Hop-Low',
                'การผลิตบุหรี่ 1 ล้านมวนต้องใช้ใบยาสูบ 1 ตัน นั้นหมายถึงต้องใช้พื้นที่ในการปลูกประมาณ 2 เท่าของสนามฟุตบอล',
                'แฉกใต้มังคุดจะมีจำนวนเท่ากับกลีบเนื้อข้างใน',
                'ส่วนที่เผ็ดที่สุดของพริก คือไส้พริก และในพริกก็มีวิตามินซี',
                'แอปเปิ้ลเป็นพืชสายพันธุ์เดียวกับกุหลาบ',
                'ขาวปลอดหนี้ ขาวเศรษฐี เป็นชื่อพันธุ์ข้าว',
                'จำนวนแถวของข้าวโพดในแต่ละฝักจะเป็นเลขคู่',
                'ไม่มีม้าลายตัวไหนในโลกที่มีลายเหมือนกัน',
                'ลูกจิงโจ้ จะเรียกว่า โจอี้ และจิงโจ้เป็นสัตว์เลี้ยงลูกด้วยนมชนิดเดียวที่เดินถอยหลังไม่ได้ และเวลามันรวมกลุ่มกันเรียกว่า Mob',
                'โลมาสามารถว่ายน้ำ และหลับได้ขณะเดียวกัน',
                'ช้างเป็นสัตว์ชนิดเดียวในโลกที่ไม่สามารถกระโดดได้',
                'มดสามารถยกของหนักกว่าตัวเองได้ถึง 50 เท่า และใช้ปากในการยก',
                'ผู้ชายจะใช้เวลาโกนหนวดรวมกันทั้งชีวิตรวมกันประมาณ 5 เดือน',
                'โลกเรามีคนเลือดกรุ๊ปโอ คิดเป็น 46 เปอร์เซ็นต์ของประชากรโลก',
                'ทั่วโลกมีคนเกิดวันเดียวกับคุณอยู่ราวๆ อย่างน้อย 9 ล้านคน',
                'คนที่ถนัดมือขาวมีอายุเฉลี่ยยืนยาวกว่าคนถนัดซ้ายถึง 9 ปี',
                'มีเด็ก 4 เปอร์เซ็นที่เกิดตามวันที่แพทย์กำหนด และเด็กที่เกิดตอนกลางวันจะมีมากกว่าผู้หญิง',
                'กลุ่มคนที่ใหญ่ที่สุดอยู่ในประเทศนิคารากัว คือ Mestizo',
                'อวัยวะที่ใหญ่ที่สุดในร่างกายคือ ผิวหนัง โดยหนักประมาณ 4 กิโลกรัม และมีพื้นที่ 2 ตารางเมตร',
                'อวัยวะเดียวในร่างกายที่มีขนาดเท่าเดิมตั้งแต่เด็กจนตายก็คือ ดวงตา',
                'เล็บมือจะยาวเร็วกว่าเล็บเท้าถึง 4 เท่า และเล็บนิ้วกลางจะเป็นนิ้วที่ยาวเร็วกว่าเล็บอื่น',
                'คนที่ตายจากการโดนมะพร้าวหล่นใส่มีจำนวนมากกว่าการโดนฉลามกัด',
                'ถ้านำเส้นเลือดทั้งหมดในร่างกายมาเรียงกันจะสามารถพันรอบโลกได้ถึงสองรอบ',
                'ฝารองโถส้วมที่เรากลัวกันมักจะสะอาดกว่าคอมพิวเตอร์ มือถือ ลูกบิดประตู โต๊ะทำงานเสมอ',
                'ตะกั่วที่ใช้ในการอุดฟันมีชื่อว่า อมันกรัม',
                ' ชื่อที่เกร่อที่สุดในอิตาลีคือ Mario Rossi',
                'ผู้ที่สูบบุหรี่เป็นชาติแรกคือชาว อินเดียแดงในทวีปอเมริกาเหนือ และอเมริกาใต้',
                'ชื่อที่พบได้มากที่สุดในโลกคือ Muhammad',
                'เมือง Aiea ในรัฐฮาวายเป็นเมืองเดียวที่สะกดด้วยสระเพียงอย่างเดียว',
                'เมืองอิสตันบูล เป็นเมืองเดียวในโลกที่ตั้งอยู่ในสองทวีป คือ เอเชีย และยุโรป',
                'เมืองชื่อ โรม มีอยู่ทุกทวีป',
                'อนุเสาวรีย์ชัยประชาธิประไตยคือจุดศูนย์กลางของจังหวัดกรุงเทพแต่การนับระยะห่างกับจังหวัดอื่นๆ ต้องเริ่มนับจากจุดเริ่มต้นของถนนอย่างเช่น ถนนหมายเลข 1 ( พหลโยธิน ) เริ่มนับจาก อนุเสาวรีย์ชัยสมรภูมิ',
                'สัตว์เลี้ยงในบ้านเพียงชนิดเดียวที่ไม่ปรากฎในพระคัมภีร์ไบเบิ้ล คือ แมว',
                'ชีเปลือย คือนักบวชศาสนาเชน นิกายทิคัมพร',
                'บทที่ยาวที่สุดในไบเบิ้ลคือ Psalm 19',
                'เดือนที่ขึ้นต้นด้วยวันอาทิตย์จะมีวันศุกร์ที่ 13',
                'ระยะทาง 1 ลี้เท่ากับ 576 เมตร',
                'ตรุษจีนเป็นเทศกาลที่สุนัขต้องทนทุกข์ทรมานจากอาการอาหารไม่ย่อยเนื่องจากตกใจเสียงประทัด',
                'ทีวี 21 นิ้วความจริงแล้วกว้าง 12 นิ้ว ยาว 16.5 นิ้ว เพราะหน่วยวัดเป็นเส้นทแยงมุม',
                'ไฟแช๊กถูกคิดค้นก่อนไม้ขีดไฟ',
                'ลีโอนาโด ดาวิชี่ คือผู้คิดค้นกรรไกร',
                'ตัว ฃ กับ ฅ อยู่บนแป้นพิมพ์เดียวกัน',
                'นิตยสาร TIME ได้ยกย่องให้คอมพิวเตอร์เป็นบุคคลแห่งปี ในปี ค.ศ. 1982',
                'ปุ่ม F5 สามารถใช้ Refresh หน้าเว็ปเพจบนอินเตอร์เน็ตได้',
                'แบงค์ 20 ของประเทศไทยมี เลข 20 อยู่ 6 แห่ง',
                'ขนมจีน ไม่ได้มาจากประเทศจีน แต่มันมาจากคำว่า ขนอมจิน ที่เป็นภาษามอญ',
                'Mc Fish ใน Mcdonal ทำมาจากปลาสายพันธุ์ ไวท์แอสกันพอลล็อก',
                'ไวน์ขาวมีแอลกอฮอล์มากกว่าไวน์แดง',
                'นวนิยายเรื่อง Jaws มีชื่อเดิมว่า The Summer of the Shark',
                'ถ้าเคี้ยวหมากฝรั่งเวลาปอกหอมจะไม่ร้องไห้',
                'ตำไทยใส่ปู กับตำปูใส่ถั่ว ไม่เหมือนกัน',
                'ตอนจบของสามก๊ก ก๊กที่รอดเป็นก๊กสุดท้าย คือก๊กของซุนกวน',
                'Guinness Book World Record  คือสมุดที่โดนขโมยมากที่สุดในห้องสมุด',
                'ตึก Empire State มีบันไดทั้งหมด 1,576 ขั้น',
                'เมืองลิมา ประเทศเปรู มีรูปปั้น วินนี่ เดอะ พูห์ ขนาดใหญ่ทำด้วยทองคำ',
                'ความสูงของมาตราฐานของบันได แต่ละขั้นคือ 18 เซนติเมตร',
                'ในหนึ่งชั่วโมง อดัม ฮอลล์เต้นท่า Moon Walk ได้ไกลถึง 2.41 กิโลเมตร',
                'ในสมัยก่อนที่อเมริกาใต้งูกะปะ อาละวาดหนักมาก บริษัท ลีวาย์ จึงผลิตกางเกงที่มีผ้าหนาๆ สีน้ำเงินขึ้นมาเพราะเชื่อกันว่า งูกะปะ กลัวสีน้ำเงิน ดังนั้นกางเกงรุ่นนั้นก็ฮิตเร็วมาก',
                'ในยุคไดโนเสาร์ไม่มีหญ้า',
                'โรงเบียร์แห่งแรกในประเทศไทยตั้งขึ้นโดย พระยาภิรมย์ภักดี เมื่อปี พ.ศ. 2478 ในชื่อ บริษัท บุญรอด บริวเวอรรี่ จำกัด',
                'ยาสีฟันดาร์ลี่เป็นเครื่องสำอางควบคุมพิเศษ',
                'ขนมเยลลี่รสผลไม้ต่างๆ เช่นตราปีโป้ ความจริงต้องเรียกว่าเยลลี่คาราจีแนน',
                'สัตว์ที่อยู่ในโลโก้ Kodomo มี หมีสีม่วง ช้างสีเขียว สิงโตสีส้ม ยีราฟสีเหลือง และกระต่ายสีขาว',
                'นมตราหมีกับเครื่องดื่มกระทิงแดง เป็นยี่ห้อที่มีสัตว์สองตัวอยู่ในโลโก้ แต่ชื่อที่เขียนไว้กับไม่เติม S',
                'กระดาษฟูสเก๊บ ได้ชื่อนี้มาจากการผลิตกระดาษโดยมีลายน้ำของรูปหมวกของตัวตลก อยู่บนกระดาษในศตวรรษ ที่ 18 กระดาษที่ว่านี้กว้าง 34 เซนติเมตร ยาว 43  เซนติเมตร',
                'ตัว O เป็นตัวอักษรที่เก่าแก่ที่สุดในโลก มันไม่เปลี่ยนรูปร่างมาตั้งแต่ 1300 ปีก่อนคริสตกาล',
                'ในภาษาอัลเบเนีย ไม่มีคำศัพท์ที่แปลว่าปวดหัว',
                'จุดที่อยู่บนตัวอักษร i เรียกว่า title',
                'คำว่า Byte ย่อมาจาก By Eight',
                'อักษร W เป็นอักษรภาษาอังกฤษเพียงตัวเดียวที่มีการออกเสียงสามพยางค์',
                'คำว่า Set ในภาษาอังกฤษ ถูกนิยามความหมายไว้มากกว่าคำอื่นๆ',
                'คำว่า Robot ที่แปลว่าหุ่นยนต์ มาจากภาษาเช็ก คำว่า Robota แปลว่าการเป็นทาส',
                'โมนาลิซ่าไม่มีคิ้ว เพราะเป็นแฟชั่นในสมัย เรอเนสซองค์ ของเมืองฟลอเรนซ์ และมันเคยมีรูปเสาอยู่ 2 ข้างของกรอบภาพ แต่โดนตัดเฉือนเพื่อไปใส่กรอบ',
                'ในชีวิตของ แวน โก๊ะ ภาพเขียนชิ้นเดียวที่เขาขายได้ คือ The Red Vineyard',
                'ฮูล่าฮูป คือของเล่นที่ขายดีที่สุดในปี ค.ศ. 1957',
                'คาราเต้ มีต้นกำเนิดมาจากประเทศ อินเดีย',
                'ภาพเงาดำในโลโก้ NBA คือเจอรรี่ เวสต์',
                'คำว่า Love ในการนับคะแนนของเทนนิส คือคำแทนการขานคะแนนศูนย์ ที่มาจากภาษาฝรั่งเศษ L’oeuf ที่แปลว่าไข่',
                'ไพ่คิงโพธิ์แดง เป็นคิงคนเดียวที่ไม่มีหนวด ส่วนแจ๊คที่ไม่มีหนวด คือแจ๊คดอกจิก',
                'รถเมล์สายที่สั้นที่สุดคือสาย 1 ที่วิ่งจากถนนตก ไปท่าเตียน',
                'รหัสโทรศัพท์ระหว่างประเทศของรัสเซียคือ 007',
                'เป๊ปซี่แบบดั้งเดิมมีสารเป๊ปซิน ซึ่งเป็นสารชนิดหนึ่งในน้ำย่อยกระเพราะอาหาร ดังนั้นจึงใช้ชื่อนี้',
                'ดิสนีย์แลนด์ มีขนาดใหญ่กว่าประเทศที่เล็กที่สุดในโลก 5 ประเทศรวมกัน',
                'แมคโดนัลด์เป็นผู้จัดจำหน่ายของเล่นที่ใหญ่ที่สุดในโลก',
                'โลโก้การบินไทย ออกแบบโดยชาวต่างชาติ',
                'โดนัลด์ ดั๊ก ถูกแบนในประเทศฟินแลนด์โทษฐานอนาจารที่ไม่ยอมสวมกางเกงใน',
                'เสียงตอนที่ E.T เดิน คือเสียงบีบเยลลี่ในมือ',
                'การติดกระดุมเสื้อจากบนลงล่างเร็วกว่าใส่จากล่างขึ้นบน',
                'คนเราหัวเราะประมาณ 15 ครั้งต่อวัน',
                'กรุงศรีอยุธยาแตกครั้งแรกในปีจุลศักราช 931 ( 9+3+1 = 13 ) ส่วนครั้งที่สองในปี จุลศักราช 1129 ( 1+1+2+9 = 13 )'
                
            ];
            var rnd = Math.floor(Math.random() * messages.length);
    
            message.channel.send(messages[rnd]);
          }
          break;
        }
      })
      command(client, 'สาระ', (message) => {
        const { guild } = message
        
        const { name, region, memberCount, owner, afkTimeout } = guild
        const icon = guild.iconURL()
        
        const embed = new Discord.MessageEmbed()
          .setTitle(`ข้อมูลเซิฟ ${name}`)
          .setThumbnail(`https://cdn.discordapp.com/attachments/871270606186905630/907473729938944040/received_808884099793370.webp`)
          .setColor("GREEN")
          .addFields(
            {
              name: '**☾Server☽**',
              value: "CNP HUB`"
            }
            
          )
          if (message.member.hasPermission('ADMINISTRATOR'))
        message.channel.send(embed)
        })

client.login(config.token) 
